{"class_name": "Model", "config": {"name": "model_7", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1024, 1024, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_8"}, "name": "input_8", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_210", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_210", "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_196", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_196", "inbound_nodes": [[["conv2d_210", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_212", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_212", "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_196", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_196", "inbound_nodes": [[["batch_normalization_196", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_197", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_197", "inbound_nodes": [[["conv2d_212", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_211", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_211", "inbound_nodes": [[["activation_196", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_197", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_197", "inbound_nodes": [[["batch_normalization_197", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_63", "trainable": true, "dtype": "float32"}, "name": "add_63", "inbound_nodes": [[["conv2d_211", 0, 0, {}], ["activation_197", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_198", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_198", "inbound_nodes": [[["add_63", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_198", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_198", "inbound_nodes": [[["batch_normalization_198", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_213", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_213", "inbound_nodes": [[["activation_198", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_215", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_215", "inbound_nodes": [[["add_63", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_199", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_199", "inbound_nodes": [[["conv2d_213", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_200", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_200", "inbound_nodes": [[["conv2d_215", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_199", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_199", "inbound_nodes": [[["batch_normalization_199", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_200", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_200", "inbound_nodes": [[["batch_normalization_200", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_214", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_214", "inbound_nodes": [[["activation_199", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_64", "trainable": true, "dtype": "float32"}, "name": "add_64", "inbound_nodes": [[["activation_200", 0, 0, {}], ["conv2d_214", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_201", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_201", "inbound_nodes": [[["add_64", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_201", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_201", "inbound_nodes": [[["batch_normalization_201", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_216", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_216", "inbound_nodes": [[["activation_201", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_218", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_218", "inbound_nodes": [[["add_64", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_202", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_202", "inbound_nodes": [[["conv2d_216", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_203", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_203", "inbound_nodes": [[["conv2d_218", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_202", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_202", "inbound_nodes": [[["batch_normalization_202", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_203", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_203", "inbound_nodes": [[["batch_normalization_203", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_217", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_217", "inbound_nodes": [[["activation_202", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_65", "trainable": true, "dtype": "float32"}, "name": "add_65", "inbound_nodes": [[["activation_203", 0, 0, {}], ["conv2d_217", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_204", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_204", "inbound_nodes": [[["add_65", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_204", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_204", "inbound_nodes": [[["batch_normalization_204", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_219", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_219", "inbound_nodes": [[["activation_204", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_221", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_221", "inbound_nodes": [[["add_65", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_205", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_205", "inbound_nodes": [[["conv2d_219", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_206", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_206", "inbound_nodes": [[["conv2d_221", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_205", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_205", "inbound_nodes": [[["batch_normalization_205", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_206", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_206", "inbound_nodes": [[["batch_normalization_206", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_220", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_220", "inbound_nodes": [[["activation_205", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_66", "trainable": true, "dtype": "float32"}, "name": "add_66", "inbound_nodes": [[["activation_206", 0, 0, {}], ["conv2d_220", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_207", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_207", "inbound_nodes": [[["add_66", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_207", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_207", "inbound_nodes": [[["batch_normalization_207", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_222", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_222", "inbound_nodes": [[["activation_207", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_224", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_224", "inbound_nodes": [[["add_66", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_208", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_208", "inbound_nodes": [[["conv2d_222", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_209", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_209", "inbound_nodes": [[["conv2d_224", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_208", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_208", "inbound_nodes": [[["batch_normalization_208", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_209", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_209", "inbound_nodes": [[["batch_normalization_209", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_223", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_223", "inbound_nodes": [[["activation_208", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_67", "trainable": true, "dtype": "float32"}, "name": "add_67", "inbound_nodes": [[["activation_209", 0, 0, {}], ["conv2d_223", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_210", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_210", "inbound_nodes": [[["add_67", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_210", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_210", "inbound_nodes": [[["batch_normalization_210", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_225", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_225", "inbound_nodes": [[["activation_210", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_211", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_211", "inbound_nodes": [[["conv2d_225", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_211", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_211", "inbound_nodes": [[["batch_normalization_211", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_226", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_226", "inbound_nodes": [[["activation_211", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_28", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_28", "inbound_nodes": [[["conv2d_226", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_28", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_28", "inbound_nodes": [[["up_sampling2d_28", 0, 0, {}], ["add_66", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_212", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_212", "inbound_nodes": [[["concatenate_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_212", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_212", "inbound_nodes": [[["batch_normalization_212", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_227", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_227", "inbound_nodes": [[["activation_212", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_229", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_229", "inbound_nodes": [[["concatenate_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_213", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_213", "inbound_nodes": [[["conv2d_227", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_214", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_214", "inbound_nodes": [[["conv2d_229", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_213", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_213", "inbound_nodes": [[["batch_normalization_213", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_214", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_214", "inbound_nodes": [[["batch_normalization_214", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_228", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_228", "inbound_nodes": [[["activation_213", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_68", "trainable": true, "dtype": "float32"}, "name": "add_68", "inbound_nodes": [[["activation_214", 0, 0, {}], ["conv2d_228", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_29", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_29", "inbound_nodes": [[["add_68", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_29", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_29", "inbound_nodes": [[["up_sampling2d_29", 0, 0, {}], ["add_65", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_215", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_215", "inbound_nodes": [[["concatenate_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_215", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_215", "inbound_nodes": [[["batch_normalization_215", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_230", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_230", "inbound_nodes": [[["activation_215", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_232", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_232", "inbound_nodes": [[["concatenate_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_216", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_216", "inbound_nodes": [[["conv2d_230", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_217", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_217", "inbound_nodes": [[["conv2d_232", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_216", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_216", "inbound_nodes": [[["batch_normalization_216", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_217", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_217", "inbound_nodes": [[["batch_normalization_217", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_231", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_231", "inbound_nodes": [[["activation_216", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_69", "trainable": true, "dtype": "float32"}, "name": "add_69", "inbound_nodes": [[["activation_217", 0, 0, {}], ["conv2d_231", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_30", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_30", "inbound_nodes": [[["add_69", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_30", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_30", "inbound_nodes": [[["up_sampling2d_30", 0, 0, {}], ["add_64", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_218", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_218", "inbound_nodes": [[["concatenate_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_218", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_218", "inbound_nodes": [[["batch_normalization_218", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_233", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_233", "inbound_nodes": [[["activation_218", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_235", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_235", "inbound_nodes": [[["concatenate_30", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_219", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_219", "inbound_nodes": [[["conv2d_233", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_220", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_220", "inbound_nodes": [[["conv2d_235", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_219", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_219", "inbound_nodes": [[["batch_normalization_219", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_220", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_220", "inbound_nodes": [[["batch_normalization_220", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_234", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_234", "inbound_nodes": [[["activation_219", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_70", "trainable": true, "dtype": "float32"}, "name": "add_70", "inbound_nodes": [[["activation_220", 0, 0, {}], ["conv2d_234", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_31", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_31", "inbound_nodes": [[["add_70", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_31", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_31", "inbound_nodes": [[["up_sampling2d_31", 0, 0, {}], ["add_63", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_221", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_221", "inbound_nodes": [[["concatenate_31", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_221", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_221", "inbound_nodes": [[["batch_normalization_221", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_236", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_236", "inbound_nodes": [[["activation_221", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_238", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_238", "inbound_nodes": [[["concatenate_31", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_222", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_222", "inbound_nodes": [[["conv2d_236", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_223", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_223", "inbound_nodes": [[["conv2d_238", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_222", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_222", "inbound_nodes": [[["batch_normalization_222", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_223", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_223", "inbound_nodes": [[["batch_normalization_223", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_237", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_237", "inbound_nodes": [[["activation_222", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_71", "trainable": true, "dtype": "float32"}, "name": "add_71", "inbound_nodes": [[["activation_223", 0, 0, {}], ["conv2d_237", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_239", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_239", "inbound_nodes": [[["add_71", 0, 0, {}]]]}], "input_layers": [["input_8", 0, 0]], "output_layers": [["conv2d_239", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}